In [188]:
import pandas as pd

names = pd.read_csv('names.txt').T.reset_index().sort_values(by=['index']).reset_index(drop=True)
alphabet = ['A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z']

In [189]:
names

        index
0       AARON
1       ABBEY
2       ABBIE
3        ABBY
4       ABDUL
...       ...
5158     ZORA
5159  ZORAIDA
5160     ZULA
5161   ZULEMA
5162    ZULMA

[5163 rows x 1 columns]

In [190]:
sum_list = []
for i in range(len(names.values)):
    num1 = 0
    num2 = names.index[i]+1
    for j in range(len(names.values[i][0])):
        for num in range(len(alphabet)):
            if alphabet[num] == names.values[i][0][j]:
                num1 += num + 1
                continue
    sum_list.append(num1*num2)
print(sum(sum_list))